// Задача 29: Напишите программу, которая задаёт массив из 8 элементов
// и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

// 6, 1, 33 -> [6, 1, 33]
int [] array = {1,2,5,7,19};
var b = string.Join(" , ", array);

Console.WriteLine($" массив --> [ {b} ]");

int[] array1 = {6,1,33 };
 
var s = string.Join(" , ", array1);
Console.WriteLine($" массив  --> [ {s} ]");