 //Задача 34:
//Задайте массив заполненный случайными положительными трёхзначными числами.
//Напишите программу, которая покажет количество чётных чисел в массиве.

//[345, 897, 568, 234] -> 2


int M = 5;
int sum = 0;
int[] S = new int[M];
Random rand =new Random();

for (int i = 0; i < M; i++)
{
    S[i] = rand.Next(100, 1000);
    if(S[i] % 2 == 0) sum++;
    
}
string a = String.Join(", ", S);
Console.WriteLine($"[{a}] --> количество четных чисел = " + sum);

